lmz.org

** cask init
#+BEGIN_SRC emacs-lisp
(require 'cask "/usr/local/Cellar/cask/0.8.1/cask.el")
(cask-initialize)
#+END_SRC

** config loadPath
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/lisp/")
(load-file (concat (file-name-directory load-file-name)
                   "lisp/core-load-paths.el"))

#+END_SRC

** user define
#+BEGIN_SRC emacs-lisp

(require 'init-package)
(require 'init-ui)
(require 'init-better-defaults)
(require 'init-org)
(require 'init-programing)
(require 'init-outline)
(require 'init-keybinding)

(setq custom-file (expand-file-name "lisp/custom.el" user-emacs-directory))
#+END_SRC

** init spacemacs
#+BEGIN_SRC emacs-lisp
(require 'core-spacemacs)
(spacemacs/init)
#+END_SRC

** sync packages
#+BEGIN_SRC emacs-lisp
;;(configuration-layer/sync)
;;(spacemacs/setup-startup-hook)
#+END_SRC


